tests/response/charge.json

{
    "response": {
        "workFlowResponse": {
            "id": 48787,
            "name": "debit creditcards (TRA)",
            "version": 0
        },
        "status": "SUCCESS",
        "message": "WorkFlow has finished successfully, for transaction Id: 7788060",
        "optionalTransactionParams": {},
        "operationSize": 2,
        "operationsArray": [
            {
                "type": "operationWithSubscriptionPlan",
                "sortedOrder": 1,
                "status": "ERROR",
                "message": null,
                "transactionId": 7788060,
                "merchantTransactionId": "33047174",
                "paySolTransactionId": "f7cdf7e2-f417-47ca-9bb8-149772f08aa6",
                "operationType": "DEBIT",
                "currency": "EUR",
                "amount": "30",
                "paymentSolution": null,
                "paymentMethod": null,
                "service": "TRA",
                "redirectionResponse": null,
                "redirectionParameters": null,
                "redirectionParam": null,
                "details": null,
                "originalTransactionId": null,
                "originalCurrency": null,
                "originalAmount": null,
                "remainingAmount": null,
                "optionalTransactionParams": null,
                "checkoutURL": null,
                "fee": null,
                "checkFields": null,
                "statusType3DS": null,
                "paymentDetails": null,
                "extraInfo": {},
                "paymentResponse": null,
                "respCode": {
                    "type": "respCode",
                    "code": "8205",
                    "message": "Error communicating to TRA",
                    "uuid": "a12b3675_3098_439a_bb2f_1ce1f2cb7c6f"
                },
                "authCode": null,
                "paymentMessage": null,
                "paymentCode": null,
                "rad": null,
                "mpi": null,
                "radMessage": null,
                "subscriptionPlan": null
            },
            {
                "type": "operationWithSubscriptionPlan",
                "sortedOrder": 2,
                "status": "REDIRECTED",
                "message": "Starting 3DSecure 2.0 process.",
                "transactionId": 1017213,
                "merchantTransactionId": "33047174",
                "paySolTransactionId": null,
                "operationType": "DEBIT",
                "currency": "EUR",
                "amount": "30",
                "paymentSolution": null,
                "paymentMethod": null,
                "service": "3DSv2",
                "redirectionResponse": "redirect:https://checkout.stg-eu-west1.epgint.com/EPGCheckout/rest/online/3dsv2/redirect?action=gatherdevice&params=eyJ0aHJlZURTdjJUb2tlbiI6IjY2M2ZiZGNkLTAxZDgtNDM2NS04OGQ0LTcxNTQzN2Q5ODdlNSIsInRocmVlRFNNZXRob2RVcmwiOiJodHRwczovL21vY2stZHMuc3RnLWV1LXdlc3QzLmVwZ2ludC5jb20vcHVibGljL21ldGhvZC1kYXRhLyIsInRocmVlRFNNZXRob2REYXRhIjoiZXlKMGFISmxaVVJUVTJWeWRtVnlWSEpoYm5OSlJDSTZJalkyTTJaaVpHTmtMVEF4WkRndE5ETTJOUzA0T0dRMExUY3hOVFF6TjJRNU9EZGxOU0lzSUNKMGFISmxaVVJUVFdWMGFHOWtUbTkwYVdacFkyRjBhVzl1VlZKTUlqb2dJbWgwZEhCek9pOHZZMmhsWTJ0dmRYUXVjM1JuTFdWMUxYZGxjM1F4TG1Wd1oybHVkQzVqYjIwdlJWQkhRMmhsWTJ0dmRYUXZZMkZzYkdKaFkyc3ZaMkYwYUdWeVJHVjJhV05sVG05MGFXWnBZMkYwYVc5dUwzQmhlWE52YkM4elpITjJNaTh4TURFM01qRXpJbjA9IiwiYnJhbmQiOiJWSVNBIiwicmVzdW1lQXV0aGVudGljYXRpb24iOiJodHRwczovL2NoZWNrb3V0LnN0Zy1ldS13ZXN0MS5lcGdpbnQuY29tL0VQR0NoZWNrb3V0L3JldHVybnVybC9mcmljdGlvbmxlc3MvcGF5c29sLzNkc3YyLzEwMTcyMTM/dGhyZWVEU3YyVG9rZW49NjYzZmJkY2QtMDFkOC00MzY1LTg4ZDQtNzE1NDM3ZDk4N2U1IiwicmVuZGVyQ2FzaGllckxvY2F0aW9uIjoiaHR0cHM6Ly9lcGdqcy1yZW5kZXJjYXNoaWVyLXN0Zy5lYXN5cGF5bWVudGdhdGV3YXkuY29tIiwiY2hhbGxlbmdlV2luZG93c1NpemUiOiIwNSJ9",
                "redirectionParameters": null,
                "redirectionParam": null,
                "details": null,
                "originalTransactionId": 7788060,
                "originalCurrency": null,
                "originalAmount": null,
                "remainingAmount": null,
                "optionalTransactionParams": {},
                "checkoutURL": null,
                "fee": null,
                "checkFields": null,
                "statusType3DS": null,
                "paymentDetails": {
                    "issuerCountry": null,
                    "issuerBank": null,
                    "cardHolderName": "First name Last name",
                    "cardType": null,
                    "cardNumber": null,
                    "account": null,
                    "cardNumberToken": null,
                    "expDate": null,
                    "extraDetails": {
                        "threeDSMethodData": "eyJ0aHJlZURTU2VydmVyVHJhbnNJRCI6IjY2M2ZiZGNkLTAxZDgtNDM2NS04OGQ0LTcxNTQzN2Q5ODdlNSIsICJ0aHJlZURTTWV0aG9kTm90aWZpY2F0aW9uVVJMIjogImh0dHBzOi8vY2hlY2tvdXQuc3RnLWV1LXdlc3QxLmVwZ2ludC5jb20vRVBHQ2hlY2tvdXQvY2FsbGJhY2svZ2F0aGVyRGV2aWNlTm90aWZpY2F0aW9uL3BheXNvbC8zZHN2Mi8xMDE3MjEzIn0=",
                        "threeDSv2Token": "663fbdcd-01d8-4365-88d4-715437d987e5"
                    }
                },
                "extraInfo": {},
                "paymentResponse": {
                    "status": "REDIRECTED",
                    "message": "Starting 3DSecure 2.0 process.",
                    "paySolTransactionId": null,
                    "details": null
                },
                "respCode": {
                    "type": "respCode",
                    "code": "8100",
                    "message": "Frictionless requires",
                    "uuid": "97dd9e32_7527_4939_bced_9c5e4d10d757"
                },
                "authCode": null,
                "paymentMessage": null,
                "paymentCode": null,
                "rad": null,
                "mpi": {
                    "txnId": null,
                    "enrolment": null,
                    "message": null,
                    "authenticationDateTime": null,
                    "authenticationStatus": null,
                    "cavv": null,
                    "eci": null,
                    "xid": null,
                    "cavvAlgorithm": null,
                    "status": null,
                    "result": null,
                    "acsUrl": null,
                    "creq": null,
                    "mpiHash": null,
                    "threeDSSessionData": null,
                    "threeDSMethodURL": "https://mock-ds.stg-eu-west3.epgint.com/public/method-data/",
                    "acsEndProtocolVersion": "2.2.0",
                    "acsStartProtocolVersion": "2.1.0",
                    "dsEndProtocolVersion": "2.2.0",
                    "dsStartProtocolVersion": "2.1.0",
                    "threeDSv2Token": null,
                    "acsInterface": null,
                    "acsUiTemplate": null,
                    "acsSignedContent": null,
                    "dsTransId": null,
                    "messageVersion": null,
                    "acsTransID": null,
                    "authData": null,
                    "authMethod": null,
                    "authTimestamp": null
                },
                "radMessage": null,
                "subscriptionPlan": null
            }
        ]
    }
}